In [1]:
import pandas as pd
import numpy as np

### Data movies

In [2]:
data = pd.read_csv("../raw_data/movies.csv")

In [3]:
data.head()

,id,name,date,tagline,description,minute,rating
0,1000001,Barbie,2023.0,She's everything. He's just Ken.,Barbie and Ken are having the time of their li...,114.0,3.91
1,1000002,Parasite,2019.0,Act like you own the place.,"All unemployed, Ki-taek's family takes peculia...",133.0,4.57
2,1000003,Everything Everywhere All at Once,2022.0,The universe is so much bigger than you realize.,An aging Chinese immigrant is swept up in an i...,140.0,4.32
3,1000004,Fight Club,1999.0,Mischief. Mayhem. Soap.,A ticking-time-bomb insomniac and a slippery s...,139.0,4.27
4,1000005,Interstellar,2014.0,Mankind was born on Earth. It was never meant ...,The adventures of a group of explorers who mak...,169.0,4.32

In [4]:
data.shape

(896400, 7)

In [5]:
data.duplicated().sum()

0

In [6]:
data.isnull().sum().sort_values(ascending=False)

rating         810786
tagline        764626
minute         187050
description    155188
date            87121
name                0
id                  0
dtype: int64

In [7]:
data.isnull().sum().sort_values(ascending=False)

rating         810786
tagline        764626
minute         187050
description    155188
date            87121
name                0
id                  0
dtype: int64

In [8]:
data.dropna(subset=['rating'], inplace= True) #Delete no rating

In [9]:
data.dropna(subset=['description'], inplace= True) #Delete no description

In [10]:
data.dropna(subset=['minute'], inplace= True) #Delete no minute

In [11]:
data.shape

(84681, 7)

In [12]:
data.drop(columns='tagline', inplace=True) #Delete feature tagline

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 84681 entries, 0 to 158773
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           84681 non-null  int64
 1   name         84681 non-null  object
 2   date         84681 non-null  float64
 3   description  84681 non-null  object
 4   minute       84681 non-null  float64
 5   rating       84681 non-null  float64
dtypes: float64(3), int64(1), object(2)
memory usage: 4.5+ MB

### Aditional Data

In [14]:
data_gen= pd.read_csv("../raw_data/genres.csv")

In [15]:
data_gen=data_gen.groupby('id').agg({'genre': ', '.join}).reset_index()

In [16]:
data_gen

             id                               genre
0       1000001          Comedy, Fantasy, Adventure
1       1000002             Comedy, Thriller, Drama
2       1000003  Science Fiction, Action, Adventure
3       1000004                               Drama
4       1000005   Science Fiction, Drama, Adventure
...         ...                                 ...
638627  1896377                              Comedy
638628  1896380                        Crime, Drama
638629  1896382                               Drama
638630  1896391                               Music
638631  1896393                            TV Movie

[638632 rows x 2 columns]

In [17]:
data_act= pd.read_csv("../raw_data/actors.csv")

In [18]:
data_act=data_act.groupby('id').agg({'name': ', '.join}).reset_index()

In [19]:
data_act

             id                                               name
0       1000001  Margot Robbie, Lewis Easter, Onyemachi Ejimofo...
1       1000002  Rosie Peralta, Anna Elisabeth Rihlmann, Andrea...
2       1000003  Randall Archer, Boon Pin Koh, Efka Kvaraciejus...
3       1000004  Leonard Termo, Greg Bronson, Michael Arturo, M...
4       1000005  Lena Georgas, Jeff Hephner, Elyes Gabel, Brook...
...         ...                                                ...
603158  1896377  Marat Basharov, Sergey Rost, Gleb Kalyuzhny, S...
603159  1896382                                   Marine Petrosyan
603160  1896387                                        Rebecca Jim
603161  1896391                                       Ko Shibasaki
603162  1896393                                    Atsuhiro Inukai

[603163 rows x 2 columns]

In [20]:
data_them= pd.read_csv("../raw_data/themes.csv")

In [21]:
data_them=data_them.groupby('id').agg({'theme': ', '.join}).reset_index()

In [22]:
data_them

            id                                              theme
0      1000001  Relationship comedy, Song and dance, Crude hum...
1      1000002  Gripping, intense violent crime, Enduring stor...
2      1000003  Funny jokes and crude humor, Tragic sadness an...
3      1000004  Graphic violence and brutal revenge, Challengi...
4      1000005  Monsters, aliens, sci-fi and the apocalypse, I...
...        ...                                                ...
24070  1674936  Noir and dark crime dramas, Bollywood emotiona...
24071  1679890  Song and dance, Dazzling vocal performances an...
24072  1734496  Suspenseful crime thrillers, Noir and dark cri...
24073  1776141  Bollywood emotional dramas, Noir and dark crim...
24074  1875153  Fascinating, emotional stories and documentari...

[24075 rows x 2 columns]

### Merge data

In [23]:
df=data.merge(data_gen, on="id", how="left")

In [24]:
df=df.merge(data_act, on="id", how="left")

In [25]:
movies=df.merge(data_them, on="id", how="left")

In [26]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84681 entries, 0 to 84680
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           84681 non-null  int64
 1   name_x       84681 non-null  object
 2   date         84681 non-null  float64
 3   description  84681 non-null  object
 4   minute       84681 non-null  float64
 5   rating       84681 non-null  float64
 6   genre        83358 non-null  object
 7   name_y       80469 non-null  object
 8   theme        23014 non-null  object
dtypes: float64(3), int64(1), object(5)
memory usage: 5.8+ MB

In [27]:
movies

,id,name_x,date,description,minute,rating,genre,name_y,theme
0,1000001,Barbie,2023.0,Barbie and Ken are having the time of their li...,114.0,3.91,"Comedy, Fantasy, Adventure","Margot Robbie, Lewis Easter, Onyemachi Ejimofo...","Relationship comedy, Song and dance, Crude hum..."
1,1000002,Parasite,2019.0,"All unemployed, Ki-taek's family takes peculia...",133.0,4.57,"Comedy, Thriller, Drama","Rosie Peralta, Anna Elisabeth Rihlmann, Andrea...","Gripping, intense violent crime, Enduring stor..."
2,1000003,Everything Everywhere All at Once,2022.0,An aging Chinese immigrant is swept up in an i...,140.0,4.32,"Science Fiction, Action, Adventure","Randall Archer, Boon Pin Koh, Efka Kvaraciejus...","Funny jokes and crude humor, Tragic sadness an..."
3,1000004,Fight Club,1999.0,A ticking-time-bomb insomniac and a slippery s...,139.0,4.27,Drama,"Leonard Termo, Greg Bronson, Michael Arturo, M...","Graphic violence and brutal revenge, Challengi..."
4,1000005,Interstellar,2014.0,The adventures of a group of explorers who mak...,169.0,4.32,"Science Fiction, Drama, Adventure","Lena Georgas, Jeff Hephner, Elyes Gabel, Brook...","Monsters, aliens, sci-fi and the apocalypse, I..."
...,...,...,...,...,...,...,...,...,...
84676,1153294,Los Angeles/Tehran,2018.0,Make the following sentences with the followin...,90.0,2.24,Comedy,"Parviz Parastouei, Mahnaz Afshar, Gohar Kheyra...",NaN
84677,1154616,Kutti Puli,2013.0,"After losing her husband at a young age, Deiva...",150.0,2.89,"Action, Thriller","G. Gnanasambandam, Raja Simman, Balasaravanan,...",NaN
84678,1156023,To Steal a Thief,1996.0,Roger is a failed petty criminal living in Sto...,93.0,2.94,"Comedy, Crime","Eva Dahlman, Agneta Guldberg, Per-Erik Bergqui...",NaN
84679,1156596,Samurai In Berlin,2019.0,The Samurai Movie in Berlin is a comedy film a...,120.0,2.31,NaN,"Hamid Farrokhnejad, Amir Mahdi Jule",NaN
84680,1158774,As Seen On Tv,2001.0,Alexander is a talk show host on TV and a part...,101.0,3.16,Comedy,"Cecilia Frode, Anna Carlsten, Magnus Härenstam...",NaN

In [29]:
movies.columns=["id", "Title", "Year", "Description","Minutes", "Rating", "Genre", "Actors", "Theme"]

In [30]:
movies.duplicated().sum()

0

In [31]:
movies.isnull().sum().sort_values(ascending=False)

Theme          61667
Actors          4212
Genre           1323
id                 0
Title              0
Minutes            0
Description        0
Year               0
Rating             0
dtype: int64

In [32]:
movies.dropna(subset=['Theme'], inplace= True) #Delete null
movies.dropna(subset=['Actors'], inplace= True)
movies.dropna(subset=['Genre'], inplace= True)

In [33]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22923 entries, 0 to 84620
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           22923 non-null  int64
 1   Title        22923 non-null  object
 2   Year         22923 non-null  float64
 3   Description  22923 non-null  object
 4   Minutes      22923 non-null  float64
 5   Rating       22923 non-null  float64
 6   Genre        22923 non-null  object
 7   Actors       22923 non-null  object
 8   Theme        22923 non-null  object
dtypes: float64(3), int64(1), object(5)
memory usage: 1.7+ MB

In [34]:
movies.to_csv('../raw_data/movies_data.csv', index=False)

: